### CSE4005: DWDM Lab - 3
#### Name: S Vijay Balaji
#### Reg. No.: 19BCE7571.
#### Slot: L29 + L30

In [184]:
# 1) Import pandas under the alias pd

import pandas as pd

In [185]:
# 2)  Print the version of pandas that has been imported.

print(pd. __version__ )

1.1.3

In [186]:
# 3) Print out all the versioninformation of the libraries that are required by the pandas library.

pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : db08276bc116c438d3fdee492026f8223584c477
python           : 3.7.5.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22000
machine          : AMD64
processor        : Intel64 Family 6 Model 158 Stepping 10, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : None.None

pandas           : 1.1.3
numpy            : 1.18.5
pytz             : 2020.1
dateutil         : 2.8.1
pip              : 21.1.1
setuptools       : 50.3.0
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : 1.3.7
lxml.etree       : 4.6.2
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.0.2
IPython          : 7.16.1
pandas_datareader: None
bs4              : 4.9.0
bottleneck       : None
fsspec           : None
fastparquet      : None
gcsfs            : None
matplotlib       : 3.2.1
numexpr          : None
odfpy            : None
openpyxl         : 3.0.6
pandas_gbq       : None
pyarrow          : None
pytables         : None
pyxlsb           : None
s3fs             : None
scipy            : 1.4.1
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
numba            : None

In [187]:
# 4) Create a DataFrame df from this dictionary data which has the index labels.

import pandas as pd
import numpy as np

import numpy as np 
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority':['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data , index=labels)
print(df)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [188]:
# 6) Display a summary of the basic information about this DataFrame and its data.

print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

In [189]:
# 6) Return the first 3 rows of the DataFrame df.

print(df.iloc[:3])

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [190]:
# 7) Select just the 'animal' and 'age' columns from the DataFrame df.

df.loc[:, ['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [191]:
# 8) Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].

df.loc[df.index[[3, 4, 8]], ['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [192]:
# 9) Select only the rows where the number of visits is greater than 3.

df[df['visits'] > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

In [193]:
# 10) Select the rows where the age is missing, i.e. it is NaN.

df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [194]:
# 11) Select the rows where the animal is a cat and the age is less than 3.

df[(df['animal'] == 'cat') & (df['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [195]:
# 12) Select the rows the age is between 2 and 4 (inclusive).

df[(df['age'] >=2) & (df['age'] <= 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

In [196]:
# 13) Change the age in row 'f' to 1.5.

df.loc['f', 'age'] = 1.5
print(df)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [197]:
# 14) Calculate the sum of all visits (the total number of visits).

sum = 0
for x in df['visits']:
    sum = sum + x
print(sum)

19

In [198]:
# 15) Calculate the mean age for each different animal in df.

df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

In [199]:
# 16) Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.
df.loc['k'] = ["bunny","3","2","yes"]
print(df.loc['k'])
df = df.drop('k')
try:
    print(df.loc['k'])
except:
    print("\nk is not in the dataframe")

animal      bunny
age             3
visits          2
priority      yes
Name: k, dtype: object

k is not in the dataframe

In [200]:
# 17) Count the number of each type of animal in df.

df['animal'].value_counts()

cat      4
dog      4
snake    2
Name: animal, dtype: int64

In [201]:
# 18) Sort df first by the values in the 'age' in decending order, then by the value in the 'visit' column in ascending order.

df.sort_values(by=['age', 'visits'], ascending=[False, True])

  animal  age visits priority
i    dog    7      2       no
e    dog    5      2       no
g  snake  4.5      1       no
j    dog    3      1       no
b    cat    3      3      yes
a    cat  2.5      1      yes
f    cat  1.5      3       no
c  snake  0.5      2       no
h    cat  NaN      1      yes
d    dog  NaN      3      yes

In [202]:
# 19) The 'priority' column contains the values 'yes' and 'no'. 
# Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.

df['priority'] = df['priority'].map({'yes': True, 'no': False})
print(df)

  animal  age visits  priority
a    cat  2.5      1      True
b    cat    3      3      True
c  snake  0.5      2     False
d    dog  NaN      3      True
e    dog    5      2     False
f    cat  1.5      3     False
g  snake  4.5      1     False
h    cat  NaN      1      True
i    dog    7      2     False
j    dog    3      1     False

In [203]:
# 20) In the 'animal' column, change the 'snake' entries to 'python'.

df['animal'] = df['animal'].replace('snake', 'python')
print(df['animal'])

a       cat
b       cat
c    python
d       dog
e       dog
f       cat
g    python
h       cat
i       dog
j       dog
Name: animal, dtype: object

In [204]:
# 21) For each animal type and each number of visits, find the mean age. 
# In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

# pd.pivot_table(df, index='animal', columns='visits', values='age', aggfunc='mean')

# pivot table does not seem to be working in this case.

In [205]:
# 22) You have a DataFrame df with a column 'A' of integers. For example:
# How do you filter out rows which contain the same integer as the row immediately above?

df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df.loc[df['A'].shift() != df['A']]

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [206]:
# 23) Given a DataFrame of numeric values, say df, how do you subtract the row mean from each element in the row?

df = pd.DataFrame(np.random.random(size=(5, 3)))
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0  0.130367 -0.246715  0.116348
1 -0.244550  0.121876  0.122674
2  0.049020  0.187465 -0.236485
3 -0.034896 -0.020221  0.055117
4  0.133005 -0.012212 -0.120793

In [207]:
# 24) Suppose you have DataFrame with 10 columns of real numbers, Which column of numbers has the smallest sum? (Find that column's label.)

df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df.sum().idxmin()

'b'

In [208]:
# 25) How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?

len(df.drop_duplicates(keep=False))

5

In [209]:
# 26) You have a DataFrame that consists of 10 columns of floating--point numbers. Suppose that exactly 5 entries in each row are NaN values. 
# For each row of the DataFrame, find the column which contains the third NaN value.

nan = np.nan
data = [[0.04,nan,nan,0.25,nan,0.43,0.71,0.51,nan,nan],
        [nan,nan,nan,0.04,0.76,nan,nan,0.67,0.76,0.16],
        [nan,nan,0.5,nan,0.31,0.4,nan,nan,0.24,0.01],
        [0.49,nan,nan,0.62,0.73,0.26,0.85,nan,nan,nan],
        [nan,nan,0.41,nan,0.05,nan,0.61,nan,0.48,0.68]]
columns=list('abcdefghij')
df=pd.DataFrame(data,columns=columns)

print((df.isnull().cumsum(axis=1) == 3).idxmax(axis=1))

0    e
1    c
2    d
3    h
4    d
dtype: object

In [210]:
# 27) A DataFrame has a column of groups 'grps' and and column of numbers 'vals'.
# For each group, find the sum of the three greatest values.

df = pd.DataFrame({'grps':list('aaabbcaabcccbbc'),'vals':[12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
df.groupby('grps')['vals'].nlargest(3).sum(level=0)

grps
a    409
b    156
c    345
Name: vals, dtype: int64

In [211]:
# 28) A DataFrame has two integer columns 'A' and 'B'. The values in 'A' are between 1 and 100 (inclusive). 
# For each group of 10 consecutive integers in 'A' (i.e. (0, 10], (10, 20], ...), calculate the sum of the corresponding values in column 'B'.

df=pd.DataFrame(np.random.RandomState(8765).randint(1,101,size=(100,2)),columns=["A","B"])

df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].sum()

A
(0, 10]      635
(10, 20]     360
(20, 30]     315
(30, 40]     306
(40, 50]     750
(50, 60]     284
(60, 70]     424
(70, 80]     526
(80, 90]     835
(90, 100]    852
Name: B, dtype: int32